var app = angular.module("myApp", []); app.controller("mainCtrl", function($scope, $document, $timeout) {
  $scope.map = [
    "🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳",
    "🔳","✳️","✳️","⬇️","⬇️","⬇️","⬇️","✳️","⬅️","✳️","➡️","➡️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","✳️","✳️","✳️","⏫","⏫","⏫","✳️","✳️","🔳",
    "🔳","✳️","➡️","🆚","🆚","🆚","🆚","⬅️","⬅️","✳️","➡️","➡️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","✳️","⏫","✳️","✳️","✳️","✳️","✳️","✳️","🔳",
    "🔳","⬇️","↘️","🆚","🆚","🆚","🆚","⬅️","↙️","⬇️","↘️","➡️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","✳️","⏫","⏫","⏫","⏫","⏫","⏫","✳️","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","↙️","⬇️","⬇️","⬇️","↘️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","✳️","✳️","✳️","✳️","⏫","🚼","✳️","✳️","🔳",
    "🔳","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","⏫","⏫","⏫","✳️","⏫","⏫","⏫","⏫","🔳",
    "🔳","✴️","✴️","✳️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","🚼","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","⏫","⏫","⏫","🔳",
    "🔳","✴️","✳️","⏫","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","⏫","🔳",
    "🔳","✴️","✴️","✳️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","✳️","✴️","✴️","✴️","✳️","✳️","✳️","⏫","⏫","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✴️","✴️","✴️","✳️","✳️","✳️","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","⏫","🔳",
    "🔳","✳️","🚹","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","⏫","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","🔳",
    "🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳"
  ];
  $scope.facing = 'down';
  $scope.constMap = angular.copy($scope.map);
  
  for (var i = 0; i < $scope.map.length; i++) {
    $scope.map[i] = {
      icon: $scope.map[i],
      id: i
    }
  }
  $scope.containsSymbol = function (square, symbol) {
    if (square.indexOf(symbol) == -1) {
      return false;
    } else {
      return true;
    }
  }
  
  $scope.isWall = function (square) {
    var solids = ['🔳', '🚾', '🚼', '⏫', '⬅️', '↙️', '⬇️', '↘️', '➡️'];
    var result = null;
    for (var i = 0; i < solids.length; i++) {
      if (!result) {
        result = $scope.containsSymbol(square.icon, solids[i])
      }
    }
    return result;
  }
  
  window.addEventListener('keydown', function(e){
      var squareX = '';
      for (var i = 0; i < $scope.map.length; i++) {
        if ($scope.map[i].icon === '🚹') {
          squareX = $scope.map[i];
        }
      }
      $timeout( function(){
        if (e.key === "ArrowRight") {
          $scope.facing = 'right';
          $scope.moveRight(squareX);
        }
        if (e.key === "ArrowLeft") {
          $scope.facing = 'left';
          $scope.moveLeft(squareX);
        }
        if (e.key === "ArrowUp") {
          $scope.facing = 'up';
          $scope.moveUp(squareX);
        }
        if (e.key === "ArrowDown") {
          $scope.facing = 'down';
          $scope.moveDown(squareX);
        }
      }, 160 );

      
      //poi
      if (e.key === "Enter") {
        if ( $scope.containsSymbol($scope.map[squareX.id + 1].icon, '🚼') || $scope.containsSymbol($scope.map[squareX.id - 1].icon, '🚼') || $scope.containsSymbol($scope.map[squareX.id + 32].icon, '🚼') ||$scope.containsSymbol($scope.map[squareX.id - 32].icon, '🚼')) {
          console.log('its a statue');
        }
      }
  });
  
  $scope.moveRight = function (square) {
    if ($scope.containsSymbol(square.icon, '🚹')) {
      if ($scope.isWall($scope.map[square.id + 1])) {
        return;
      } else{
        $scope.map[square.id + 1].icon = '🚹';
        if ($scope.constMap[square.id] !== '🚹') {
          square.icon = $scope.constMap[square.id];
        } else{
          square.icon = "";
        }
        $scope.$digest();
      }
    }
  }
  $scope.moveLeft = function (square) {
    if ($scope.containsSymbol(square.icon, '🚹')) {
      if ($scope.isWall($scope.map[square.id - 1])) {
        return;
      } else{
        $scope.map[square.id - 1].icon = '🚹';
        if ($scope.constMap[square.id] !== '🚹') {
          square.icon = $scope.constMap[square.id];
        } else{
          square.icon = "";
        }
        $scope.$digest();
      }
    }
  }
  $scope.moveUp = function (square) {
    if ($scope.containsSymbol(square.icon, '🚹')) {
      if ($scope.isWall($scope.map[square.id - 32])) {
        return;
      } else{
        $scope.map[square.id - 32].icon = '🚹';
        if ($scope.constMap[square.id] !== '🚹') {
          square.icon = $scope.constMap[square.id];
        } else{
          square.icon = "";
        }
        $scope.$digest();
      }
    }
  }
  $scope.moveDown = function (square) {
    if ($scope.containsSymbol(square.icon, '🚹')) {
      if ($scope.isWall($scope.map[square.id + 32])) {
        return;
      } else{
        $scope.map[square.id + 32].icon = '🚹';
        if ($scope.constMap[square.id] !== '🚹') {
          square.icon = $scope.constMap[square.id];
        } else{
          square.icon = "";
        }
        $scope.$digest();
      }
    }
  }
  
});
