var app = angular.module("myApp", []); app.controller("mainCtrl", function($scope, $document, $timeout) {
  $scope.map = [
    "🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳",
    "🔳","✳️","✳️","⬇️","⬇️","⬇️","⬇️","✳️","⬅️","✳️","➡️","➡️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","✳️","✳️","✳️","⏫","⏫","⏫","✳️","✳️","🔳",
    "🔳","✳️","➡️","🆚","🆚","🆚","🆚","⬅️","⬅️","✳️","➡️","➡️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","✳️","⏫","✳️","✳️","✳️","✳️","✳️","✳️","🔳",
    "🔳","⬇️","↘️","🆚","🆚","🆚","🆚","⬅️","↙️","⬇️","↘️","➡️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","✳️","⏫","⏫","⏫","⏫","⏫","⏫","✳️","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","↙️","⬇️","⬇️","⬇️","↘️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","✳️","✳️","✳️","✳️","⏫","🚼","✳️","✳️","🔳",
    "🔳","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","⏫","⏫","⏫","✳️","⏫","⏫","⏫","⏫","🔳",
    "🔳","✴️","✴️","✳️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","🚼","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","⏫","⏫","⏫","🔳",
    "🔳","✴️","✳️","⏫","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","⏫","🔳",
    "🔳","✴️","✴️","✳️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✝️","✝️","✝️","✝️","✝️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","🆚","🆚","🆚","🆚","🆚","🆚","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","🆚","🆚","🆚","🆚","🆚","🆚","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","🚾","⬅️","✴️","✴️","➡️","🚾","🚾","🚾","🚾","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","↙️","⬇️","⬇️","↘️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","⬅️","✳️","✳️","➡️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","⬅️","✳️","✳️","➡️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","↙️","⬇️","⬇️","↘️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","⬅️","✳️","✳️","➡️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","🚾","⬅️","⏫","✳️","➡️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🔳",
    "🔳","✳️","↙️","⬇️","⬇️","↘️","✳️","✳️","⏫","⏫","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","🚾","✴️","✴️","✴️","🚾","🚾","🚾","🚾","🚾","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✴️","✴️","✴️","✴️","✳️","✳️","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","⏫","⏫","⏫","🔳",
    "🔳","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✳️","✴️","✴️","✴️","✳️","✳️","✳️","✳️","⏫","⏫","⏫","⏫","⏫","⏫","⏫","⏫","🔳",
    "🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳"
  ];
  $scope.facing = 'down';
  $scope.offset = false;
  $scope.jump = false;
  $scope.modal = false;
  $scope.playerPos = 48;
  $scope.editSquare = null;
  $scope.editMode = false;
  $scope.constMap = angular.copy($scope.map);
  
  for (var i = 0; i < $scope.map.length; i++) {
    if (i === $scope.playerPos) {
      $scope.map[i] = {
        icon: '🚹',
        id: i
      }
    } else {
      $scope.map[i] = {
        icon: $scope.map[i],
        id: i
      }
    }

  }
  $scope.containsSymbol = function (square, symbol) {
    if (square.indexOf(symbol) == -1) {
      return false;
    } else {
      return true;
    }
  }
  
  $scope.isWall = function (square) {
    var solids = ['🔳', '🚾', '🚼', '⏫', '⬅️', '↙️', '⬇️', '↘️', '➡️', '✝️'];
    var result = null;
    for (var i = 0; i < solids.length; i++) {
      if (!result) {
        result = $scope.containsSymbol(square.icon, solids[i])
      }
    }
    return result;
  }
  
  $scope.setEditSquare = function (sq) {
    $scope.editSquare = sq;
  }
  
  window.addEventListener('keydown', function(e){
      var squareX = '';
      for (var i = 0; i < $scope.map.length; i++) {
        if (squareX === '' && $scope.map[i].icon === '🚹') {
          squareX = $scope.map[i];
          break;
        }
      }
      $scope.modal = false;
      $timeout( function(){
        if (e.key === "ArrowRight") {
          $scope.facing = 'right';
          $scope.moveRight(squareX);
        }
        if (e.key === "ArrowLeft") {
          $scope.facing = 'left';
          $scope.moveLeft(squareX);
        }
        if (e.key === "ArrowUp") {
          $scope.facing = 'up';
          $scope.moveUp(squareX);
        }
        if (e.key === "ArrowDown") {
          $scope.facing = 'down';
          $scope.moveDown(squareX);
        }
      }, 300 );
      
      //poi
      if (e.key === "Enter") {
        $scope.modal = false;
        if ( $scope.containsSymbol($scope.map[squareX.id + 1].icon, '🚼') || $scope.containsSymbol($scope.map[squareX.id - 1].icon, '🚼') || $scope.containsSymbol($scope.map[squareX.id + 32].icon, '🚼') ||$scope.containsSymbol($scope.map[squareX.id - 32].icon, '🚼')) {
          if ($scope.modal === false) {
            $scope.modal = true;
          }
        }
        $scope.$digest();
      }
  });
  
  $scope.moveRight = function (square) {
    if ($scope.containsSymbol(square.icon, '🚹')) {
      if ($scope.isWall($scope.map[square.id + 1])) {
        return;
      } else{
        $scope.offset = true;
        $scope.$digest();
        
        $timeout( function(){
          $scope.map[square.id + 1].icon = '🚹';
          if ($scope.constMap[square.id] !== '🚹') {
            square.icon = $scope.constMap[square.id];
            $scope.playerPos = square.id + 1;
          } else{
            square.icon = "";
          }
          $scope.offset = false;
          $scope.$digest();
        }, 150 );
      }
    }
  }
  $scope.moveLeft = function (square) {
    if ($scope.containsSymbol(square.icon, '🚹')) {
      if ($scope.isWall($scope.map[square.id - 1])) {
        return;
      } else{
        $scope.offset = true;
        $scope.$digest();
        
        $timeout( function(){
          $scope.map[square.id - 1].icon = '🚹';
          if ($scope.constMap[square.id] !== '🚹') {
            square.icon = $scope.constMap[square.id];
            $scope.playerPos = square.id - 1;
          } else{
            square.icon = "";
          }
          $scope.offset = false;
          $scope.$digest();
        }, 150 );
      }
    }
  }
  $scope.moveUp = function (square) {
    if ($scope.containsSymbol(square.icon, '🚹')) {
      if ($scope.isWall($scope.map[square.id - 32])) {
        return;
      } else{
        $scope.offset = true;
        $scope.$digest();
        
        $timeout( function(){
          $scope.map[square.id - 32].icon = '🚹';
          if ($scope.constMap[square.id] !== '🚹') {
            square.icon = $scope.constMap[square.id];
            $scope.playerPos = square.id - 32;
          } else{
            square.icon = "";
          }
          $scope.offset = false;
          $scope.$digest();
        }, 150 );
      }
    }
  }
  $scope.moveDown = function (square) {
    if ($scope.containsSymbol(square.icon, '🚹')) {
      if ($scope.isWall($scope.map[square.id + 32]) && $scope.map[square.id+32].icon !== '⬇️') {
        return;
      } else if($scope.map[square.id + 32].icon === '⬇️'){
        $scope.jump = true;
        $scope.$digest();
        
        $timeout( function(){
          $scope.map[square.id + 64].icon = '🚹';
          if ($scope.constMap[square.id] !== '🚹') {
            square.icon = $scope.constMap[square.id];
            $scope.playerPos = square.id + 64;
          } else{
            square.icon = "";
          }
          $scope.jump = false;
          $scope.$digest();
        }, 150 );
      }
      else{
        $scope.offset = true;
        $scope.$digest();
        
        $timeout( function(){
          $scope.map[square.id + 32].icon = '🚹';
          if ($scope.constMap[square.id] !== '🚹') {
            square.icon = $scope.constMap[square.id];
          } else{
            square.icon = "";
          }
          $scope.offset = false;
          $scope.$digest();
        }, 150 );
      }
    }
  }
  
});
